Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
layer1 (Dense)               (None, 50)                100       
_________________________________________________________________
layer2 (Dense)               (None, 10)                510       
_________________________________________________________________
layer3 (Flatten)             (None, 10)                0         
=================================================================
Total params: 610
Trainable params: 610
Non-trainable params: 0
_________________________________________________________________
